БухЭксп/Catalogs/CW_СтатьиДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_СтатьиДДС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженияДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидОперацииПлатежногоПоручения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыДвиженияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыДвиженияДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_СтатьиДДС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОсновнойВидОперацииПлатежногоПоручения.Видимость  = Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход");
	УстановитьОтбор();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	Список.Отбор.Элементы.Очистить();
	Отбор					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СтатьяДДС");
	Отбор.ПравоеЗначение	= Объект.Ссылка;
	Отбор.Использование		= Истина;
	
	Элементы.Список.ТолькоПросмотр = Объект.Ссылка.Пустая();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,ПолучитьСтатью(ВыбраннаяСтрока));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатью(Ключ)
	Возврат Ключ.СтатьяДвиженияДенежныхСредств		
КонецФункции

&НаКлиенте
Процедура ВидДвиженияПриИзменении(Элемент)
	Элементы.ОсновнойВидОперацииПлатежногоПоручения.Видимость  = Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход");
КонецПроцедуры

&НаСервере
Процедура УстановитьОсновнойНаСервере(СтатьяДвиженияДенежныхСредств)
	
	Объект.ОсновнаяСтатьяДДС = СтатьяДвиженияДенежныхСредств; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновной(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		УстановитьОсновнойНаСервере(ТекущаяСтрока.СтатьяДвиженияДенежныхСредств);
		УстановитьПометкуКнопки(ТекущаяСтрока.СтатьяДвиженияДенежныхСредств);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		УстановитьПометкуКнопки(ТекущаяСтрока.СтатьяДвиженияДенежныхСредств);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуКнопки(СтатьяДвиженияДенежныхСредств)
	Элементы.СписокУстановитьОсновной.Пометка = СтатьяДвиженияДенежныхСредств = Объект.ОсновнаяСтатьяДДС;
КонецПроцедуры
